{"1": ["dash button", "A small, Wi-Fi connected device that allows users to reorder commonly used household items with the press of a button.", "An application that enables users to manage and control various Internet of Things (IoT) devices from a centralized interface.", "An application specifically designed for Apple devices that enables users to manage and control IoT devices from their iPhone, iPad, or Mac.", "A central hub or interface used to manage and control multiple smart home devices and systems.", "A device installed in walls or floors that provides electricity to appliances and devices when plugged in.", "A central device or system that connects and controls various smart home devices, serving as a communication bridge between devices and the user.", "A system or device that monitors and tracks energy consumption in a home, helping users identify energy-saving opportunities and reduce costs.", "iot sevices controller application", "A central hub or application that allows users to manage and control various smart home devices, such as lights, locks, and thermostats, from a single interface.", "iot sevices controller application for apple", "smart home devices controller", "energy usage tracker", "controller", "outlet", "hub", "smart home hub"], "10": ["A switch that can be controlled remotely via a smartphone app or voice assistant, allowing users to turn devices on and off from anywhere.", "echo dot ", "A compact smart speaker powered by Alexa, capable of voice control for smart home devices, music playback, and more.", "A system of speakers integrated with voice assistants like Alexa or Google Assistant, allowing users to control smart home devices, play music, and access information via voice commands.", "smart switch", "smart speaker system"], "0": ["A device used to regulate indoor temperature, typically programmable and controllable remotely via a smartphone app.", "A device that removes contaminants from the air, improving indoor air quality by filtering out particles like dust, pollen, and pet dander.", "A cooling system that regulates indoor temperature and humidity levels, providing comfort during hot weather by circulating cool air throughout a room or building.", "A cooling system that regulates indoor temperature and humidity levels, providing comfort during hot weather.", "air purifier", "A device that adds moisture to the air to prevent dryness, often used in bedrooms or living spaces to alleviate dry skin, throat irritation, and static electricity.", "humidifier ", "air conditioner", "thermostat"], "5": ["A device used to remotely monitor sounds and movements of a baby or child, providing reassurance to parents and caregivers.", "A device used to capture still images or video footage, often equipped with features like motion detection and live streaming for home security.", "air quality sensor", "A device that monitors indoor air quality, measuring levels of pollutants and providing real-time data for better environmental health.", "A network of devices and sensors designed to detect intruders, monitor activity, and provide alerts for enhanced home security.", "A device that detects the presence of smoke and carbon monoxide in the air, providing early warnings of potential hazards.", "A device used to capture video footage for surveillance, monitoring, or recording purposes.", "A device that senses smoke, typically through the presence of combustion particles, and emits an alarm to alert occupants of a potential fire.", "A sensor designed to detect the presence of water, typically used to alert homeowners to potential leaks or flooding.", "A package of sensors, detectors, and a central hub designed to provide comprehensive monitoring and security for a home.", "A versatile sensor capable of detecting various environmental factors such as motion, temperature, and humidity, offering flexibility for different applications.", "camera", "A system of cameras used to monitor and record activity in and around a property, providing security and peace of mind.", "An integrated system that combines security features such as alarms and surveillance with automation capabilities for controlling various aspects of the home environment.", "A device that detects movement and triggers actions or alerts, often used for security or automation purposes.", "A smart doorbell equipped with a camera and motion sensor, allowing users to see and communicate with visitors remotely via a smartphone app.", "A device that detects movement within its field of view and triggers actions or alerts, commonly used for security and automation purposes.", "A sensor that detects when a person or object enters a predefined area, often used to trigger actions like turning on lights or adjusting thermostats.", "home security system", "A sensor that detects freezing temperatures and alerts homeowners to the risk of frozen pipes, helping prevent water damage.", "A sensor specifically designed to detect the presence of water, helping homeowners identify leaks and prevent water damage.", "video surveillance", "baby monitor", "smoke and carbon monoxide detector ", "Similar to a smoke detector, a smoke alarm detects smoke and triggers an audible and/or visual alarm to warn occupants of a fire hazard.", "home security and home automation system", "motion sensor", "video camera", "ring doorbell", "smoke detector", "smoke alarm", "water leak  detector", "water freeze detector", "home monitoring kit", "multipurpose sensor", "arrival sensor", "water leak sensor"], "11": ["amazon fire tv stick", "A streaming media player that plugs into an HDMI port on your TV, providing access to thousands of apps, games, and streaming services."], "3": ["A system or application that allows users to monitor and control various kitchen and laundry appliances, such as ovens, refrigerators, washers, and dryers.", "An application or system that allows users to monitor and control various kitchen appliances and safety devices for enhanced convenience and safety.", "A device used to generate heat, commonly used for warming specific rooms or spaces within a home.", "A device that heats water for domestic use, providing hot water for bathing, cooking, and cleaning.", "heater", "A kitchen appliance used for baking, roasting, and heating food, available in various types including conventional, convection, and microwave ovens.", "A combination appliance consisting of a stove and oven, typically used for cooking multiple dishes simultaneously.", "An appliance used for storing and preserving food at low temperatures, equipped with features like adjustable shelves, temperature control, and ice makers.", "A kitchen appliance used for baking, roasting, and heating food, available in various types including conventional, convection, and smart ovens.", "An appliance used for storing and preserving food at low temperatures, equipped with features like adjustable shelves, temperature control, and smart connectivity.", "slow cooker", "A countertop appliance designed for slow cooking food at low temperatures over an extended period, ideal for preparing stews, soups, and tender meats.", "A compact grill designed for use on kitchen countertops, allowing for convenient indoor grilling of meats, vegetables, and more.", "A combination appliance that functions as both a washing machine and a clothes dryer, saving space and streamlining laundry routines.", "A machine used for drying clothes and textiles after washing, often available as standalone units or combined with a washer in a laundry set.", "countertop grill", "kitchen and laundry appliances controller", "A machine designed for cleaning dishes and utensils automatically, reducing the need for manual scrubbing and washing.", "A machine used for washing clothes and other textiles, available in various capacities and features for different laundry needs.", "oven", "A kitchen appliance used to brew coffee, available in various types including drip, espresso, and single-serve machines.", "range", "refrigerator", "dishwasher", "washer dryer", "water heater", "kitchen living and safety devices controller", "washer", "dryer", "coffee maker"], "2": ["A motorized device that opens and closes garage doors remotely, typically controlled via a smartphone app or a physical remote.", "A smart lock that can be remotely controlled and monitored, providing enhanced security and convenience for homeowners.", "garage door opener", "Smart locks equipped with features like keyless entry, remote locking/unlocking, and integration with smart home systems for enhanced security and convenience.", "A type of lock mechanism commonly used on exterior doors, typically operated by a key or electronic keypad for added security.", "lock", "home locks", "deadbolt", "A handle used to open and close doors, often paired with a deadbolt or other locking mechanism for security.", "doorknob"], "7": ["A device used to control the flow of electricity to light fixtures or appliances, available in various types including traditional, smart, and dimmer switches.", "A device used to adjust the brightness of light fixtures, providing flexibility and ambiance control.", "light", "A smart light bulb or lighting system that can be controlled remotely, dimmed, and scheduled for automated operation.", "Smart light bulbs or lighting systems that can be controlled remotely, dimmed, and scheduled for automated operation.", "An application or system that allows users to control various lighting products, such as dimmers, light strips, switches, and controllers, for customized lighting experiences.", "A flexible strip of LED lights used for decorative or ambient lighting, often controllable via smartphone apps or smart home systems.", "lighting products controller", "dimmer", "light strip", "switch"], "4": ["cybersecurity for iot devices", "Security measures and protocols implemented to protect Internet of Things devices from cyber threats and unauthorized access."], "8": ["An autonomous vacuum cleaner that navigates and cleans floors automatically, saving time and effort for homeowners.", "robot vaccum", "A robot vacuum equipped with cameras for live monitoring of cleaning progress and ensuring safety during operation.", "robot vaccum with safety monitor by video feed"], "6": ["gps asset tracking", "Technology used to track the location of assets such as vehicles, equipment, or packages in real-time using GPS technology."], "9": ["A mattress equipped with sensors and technology to track sleep patterns, monitor vital signs, and provide features like temperature control for improved sleep quality.", "smart mattress"], "12": ["smart massage chair", "A chair equipped with advanced technology and sensors to provide a variety of massage techniques, often including features like customizable massage programs, heat therapy, body scanning for personalized massages."]}